# [93/9] Getting started with Pandas

In [2]:
import pandas 
df1 = pandas.DataFrame([[2,4,6],[10,20,30]])
df1

    0   1   2
0   2   4   6
1  10  20  30

In [4]:
df1 = pandas.DataFrame([[2,4,6],[10,20,30]], columns = ["Price","Age","Value"])
df1

   Price  Age  Value
0      2    4      6
1     10   20     30

In [6]:
df1 = pandas.DataFrame([[2,4,6],[10,20,30]], columns = ["Price","Age","Value"], index = ["First","Second"])
df1

        Price  Age  Value
First       2    4      6
Second     10   20     30

In [9]:
# another method for creating data frames
df2 = pandas.DataFrame([{"Name":"John","Surname":"Johnson"},{"Name":"Jack"}])
df2

   Name  Surname
0  John  Johnson
1  Jack      NaN

In [13]:
# avg for all columns
df1.mean()

Price     6.0
Age      12.0
Value    18.0
dtype: float64

In [18]:
# avg for whole table
df1.mean().mean()

12.0

In [20]:
type(df1.Price)

pandas.core.series.Series

In [21]:
type(df1.mean())

pandas.core.series.Series

In [22]:
df1.Price

First      2
Second    10
Name: Price, dtype: int64

In [25]:
df1.Price.mean()

6.0

In [29]:
df1.Price.max()

10